[
{
"name": "Alexey",
"surname": "Vasyukov",
"company": "CTO, ITD Systems",
"companyUrl": "",
"image": "AlexeyVasyukov.png",
"summary":"Alexey Vasyukov works as CTO at ITD Systems, developer of Alvex solution. Alexey leads Alvex solution development as chief architect. He is responsible for principal technical decisions during planning. So, if something goes wrong in the wild - non-standard setup is required or Alvex does not work on the latest Alfresco release - it is also Alexey's headache. Prior to ITD Systems he worked for VDEL as consultant and presale team lead helping partners and customers to build solutions based on open source technologies. Alexey has a Ph.D. in Mathematical Modeling, Numerical Methods, and Software Complexes from Moscow Institute of Physics and Technology. "
},
{
"name": "Alexey",
"surname": "Ermakov",
"company": "CTO, ITD Systems",
"companyUrl": "",
"image": "AlexeyErmakov.png",
"summary":"ITD Systems lead developer, his presentation at Alfresco DevCon 2011 - http://www.slideshare.net/oksanakurysheva/alfresco-devcon-2011-implementing-egov-portal-powered-by-alfresco-and-orbeon "
},
{
"name": "Andrew",
"surname": "Short",
"company": "CERN - eFiles project leader",
"companyUrl": "",
"image": "AndrewShort.png",
"summary":"Started working with Alfresco over 1 year ago and since then we have implemented records management in the Records Office and is continuing to roll this success out to more services at CERN.  "
},
{
"name": "Angel",
"surname": "Borroy",
"company": "Developer at keensoft",
"companyUrl": "",
"image": "AngelBorroy.png",
"summary":"Angel Borroy is technical lead architect at keensoft. Over the last 15 years, he has been working as a software architect on Java, BPM, document management and electronic signatures. He has been working with Alfresco during the last years to customize several implementations in large organizations and to provide add-ons to the Community based on Record Management and Electronic Signature. He writes (sometimes) on his personal blog angelborroy.wordpress.com. "
},
{
"name": "Axel",
"surname": "Faust",
"company": "Senior IT-Consultant / Software Architect, PRODYNA AG",
"companyUrl": "",
"image": "AxelFaust.png",
"summary":"I started working full-time on Alfresco-related projects in 2010, engaging with wider community in 2012. Apart from the 'all-rounder' type of engagement in customer projects I have focused part of my interest on the complex interactions between core components of Alfresco, i.e. auditing, scripting, as well as matters of extending Alfresco in a sustainable way where it may not have been engineered to be extended in the first place. "
},
{
"name": "Bindu",
"surname": "Wavell",
"company": "Chief Architect @ Zia Consulting, Inc.",
"companyUrl": "",
"image": "BinduWavell.png",
"summary":"As the Chief Architect at Zia Consulting (an Alfresco Platinum implementation partner). One of my mandates is to help improve developer productivity. "
},
{
"name": "Boriss",
"surname": "Mejías",
"company": "Holistic System Software Engineer - CIRB-CIBG",
"companyUrl": "",
"image": "BorissMejías.png",
"summary":"Co-founder and active member of the Order of the Bee. I've been involved with the Alfresco community and the Alfresco software since 2011. My work at CIRB-CIBG involves the administration of several Alfresco instances, being responsible for their correct operation. Hence, I have to be ready for the coming of the failure. To reduce the stress, I regularly test backups and the recovery process. And this is what I want to share with the attendees. "
},
{
"name": "Cristina",
"surname": "Martín",
"company": "CCO of Venzia IT",
"companyUrl": "",
"image": "CristinaMartín.png",
"summary":"null"
},
{
"name": "David",
"surname": "Webster",
"company": "Engineer, Alfresco.",
"companyUrl": "",
"image": "DavidWebster.png",
"summary":"I started working with Alfresco 6 years ago when I joined the core engineering team. I've been working with Alfresco One on a daily basis since then. "
},
{
"name": "Fran",
"surname": "Alvarez",
"company": "Technical Architect at Ixxus",
"companyUrl": "",
"image": "FranAlvarez.png",
"summary":"Working from Alfresco since 2007, for European and US projects, now as technical architect for the platinum partner Ixxus "
},
{
"name": "Francesco",
"surname": "Corti",
"company": "ECM and BI specialist, FDM Document Dynamics",
"companyUrl": "",
"image": "FrancescoCorti.png",
"summary":"I'm an open source enthusiast so, how can I ignore Alfresco? In a similar manner I started to work on Pentaho and later I had the idea to integrate them together. Inventor, designer and developer of AAAR, I'm member of the Order of The Bee and Pentaho community. "
},
{
"name": "Gianni",
"surname": "Ciolli",
"company": "Principal Consultant, 2ndQuadrant",
"companyUrl": "",
"image": "GianniCiolli.png",
"summary":"I'm quite new to Alfresco, as my expertise is on databases, and in particular PostgreSQL, with which I have been working for almost a decade.  I believe Alfresco can benefit a lot from PostgreSQL by going beyond a default installation; so I will present topics such as Point-In-Time Recovery, High Availability/Replication, simple database management and performance optimisation (some or all depending on the length of the talk).  My profile suits this topic in view of my experience as a speaker in several PostgreSQL conferences, in Europa and USA, with talks that covered general overviews as well as specific topics.  I always enjoy to take questions from the audience and discuss specific points in more detail, either during the talk or after. "
},
{
"name": "Hans",
"surname": "De Bal",
"company": "Senior ECM Consultant at Amplexor",
"companyUrl": "",
"image": "HansDeBal.png",
"summary":"Since almost 10 years I am working in the ECM-world. I first started with Documentum but since 4 years my focus shifted to Alfresco. During one of our previous projects we need to customize Share but keep in mind that a OOTB Share would be installed too. We had to keep this in mind for every change we made to the repository and needed to 'fix' some OOTB webscripts and functionalities. We would like to share this knowledge with you.  I am married and have one daughter. "
},
{
"name": "Heiko",
"surname": "Robert",
"company": "ceo, ecm4u GmbH",
"companyUrl": "",
"image": "HeikoRobert.png",
"summary":"https://summit.alfresco.com/2014-speakers/heiko-robert * Alfresco experience since the beginning but also strong ECM consultancy background in general * infrastructure junky - loves big, scalable systems "
},
{
"name": "Heiko",
"surname": "Robert (hi-ko)",
"company": "ceo, ecm4u GmbH",
"companyUrl": "",
"image": "HeikoRobert(hi-ko).png",
"summary":"null"
},
{
"name": "Ian",
"surname": "Wright",
"company": "Principle Scientific Software Developer, University of Oxford",
"companyUrl": "",
"image": "IanWright.png",
"summary":"I've been working with Alfresco on and off for around five years and have regularly contributed  to the SSO forum. I've implemented CAS SSO with at least three different versions of Alfresco as well as a number of other applications. "
},
{
"name": "Joost",
"surname": "Horward",
"company": "Open-T",
"companyUrl": "",
"image": "JoostHorward.png",
"summary":"I am an Alfresco consultant/trainer since 2007 (yep, when Alfresco 1.4 was cool). Did a lot of implementations and customizations. "
},
{
"name": "Joram",
"surname": "Barrez",
"company": "Principal Software Engineer @ Alfresco",
"companyUrl": "",
"image": "JoramBarrez.png",
"summary":"Co-founder of the Activiti project (http://activiti.org/). "
},
{
"name": "Lutz",
"surname": "Horn",
"company": "Developer at ecm4u GmbH",
"companyUrl": "",
"image": "LutzHorn.png",
"summary":"Developing on Alfresco since three years, building a broad range of solutions both as projects for customers and as reusable solutions. Java programmer and Python lover :) "
},
{
"name": "Martin",
"surname": "Cosgrave",
"company": "Community Volunteer",
"companyUrl": "",
"image": "MartinCosgrave.png",
"summary":"Alfresco Hobbyist and Activist, Founder- and Board- member of The Order Of The Bee "
},
{
"name": "Daren",
"surname": "Firminger",
"company": "Community Volunteer",
"companyUrl": "",
"image": "DarenFirminger.png",
"summary":"Digital Catalyst owner & director. "
},
{
"name": "Samuel",
"surname": "Masue",
"company": "Software engineer at CERN",
"companyUrl": "",
"image": "SamuelMasue.png",
"summary":"First of all my name is Samuel Masue. I am a 26 year old software engineer currently working at CERN in Geneva area. I have been studying and working in the field of software development for almost 10 years now. More particularly, the last two years I have been extending Alfresco on a daily basis work. Indeed, I've been hired at CERN to start an exciting project of documents and records management for which Alfresco was chosen as foundation. The project went live in March 2015 with Alfresco Community 5.0.c. We started with a small population of users and few features. Since that, supported by it success the application keeps growing every day, evolving more users, more features. Spending hours digging into the code, now I would like to share my knowledge and my experience. I am willing to help people and always looking to improve my knowledge. For all of these reasons I recently started to write a blog. "
},
{
"name": "Michael",
"surname": "Suzuki",
"company": "Engineer Alfresco",
"companyUrl": "",
"image": "MichaelSuzuki.png",
"summary":"Michael is an engineer with more than 15 years experience in software development. He has been a member of Alfresco's benchmarking team for 3+ years. Most recently he has been working on automation and developing the Alfresco Test Platform.  "
},
{
"name": "Niraj",
"surname": "Meegama",
"company": "Senior software engineer, Zaizi",
"companyUrl": "",
"image": "NirajMeegama.png",
"summary":"I am not a Alfresco Developer but, I am a web developer for Zaizi a company that does a lot of Alfresco related projects and I get to build a lot of websites on top of alfresco and also use a lot of API's Alfresco has to offer. While doing this I had a lot of trouble trying to understand Alfresco and also to debug and learn how the APIs function. So I always end up troubling my fellow Alfresco developers. So I came up with an easy way of dealing with it and also I would like to tell my side of the story. I work a lot with PHP and Javascript and occasionally python. I found a way to use the things I know in order to make working with Alfresco easy "
},
{
"name": "Oksana",
"surname": "Kurysheva",
"company": "Project Manager, ITD Systems",
"companyUrl": "",
"image": "OksanaKurysheva.png",
"summary":"Oksana Kurysheva is responsible for project management and business development at ITD Systems, developer of Alvex solution for dynamic business process and case management. Working with partners and customers around whole Eastern Europe since 2009, Oksana has helped many companies to start using Alfresco and many system integrators to implement their first projects successfully. As a project manager of the solution developer she communicates with customers and partners on all stages of their implementation projects every day. Oksana is also a certified Alfresco and Alvex instructor, r̶e̶g̶u̶l̶a̶r̶l̶y̶ rarely conducting training courses throughout Eastern Europe and Russia. Also Oksana is a member of the Order of the Bee. "
},
{
"name": "Ole",
"surname": "Hejlskov",
"company": "Developer Evangelist, Alfresco",
"companyUrl": "",
"image": "OleHejlskov.png",
"summary":"After five years as an active member of the Alfresco Community I helped co-found The Order Of the Bee and was initially on the board, until I joined Alfresco as Developer Evangelist in April 2015.   I have more than 14 years of experience in the industry ranging from tech support, systems administration, development, project management, team lead and now developer evangelism.   I have been a big contributor to the Alfresco SDK, proud member of The Order Of the Bee, written various tutorials and video tutorials on both Aikau, Alfresco and Alfresco SDK. "
},
{
"name": "Olivier",
"surname": "Anh",
"company": "Web Project Manager at Bata Brands",
"companyUrl": "",
"image": "OlivierAnh.png",
"summary":"Being in the IT department, I've been asked to look for solution for storage and BPMN engine for a new Shared ServiceCentre we were building. Alfresco have been selected and I've asked to set up the server and customise it for the purpose (API, Rules, maintenance) "
},
{
"name": "Philippe",
"surname": "Dubois",
"company": "Support expert team",
"companyUrl": "",
"image": "PhilippeDubois.png",
"summary":"Working for Alfresco since 10 yars. Working in Alfresco support.  "
},
{
"name": "Richard",
"surname": "Esplin",
"company": "Product Manager at Alfresco",
"companyUrl": "",
"image": "RichardEsplin.png",
"summary":"Since discovering Linux in college, I have been enamored with open source products. When I got my opportunity to join Alfresco six years ago, I jumped at the chance to be part of an open source business model that works. At Alfresco I have been a solutions engineer, community marketer, developer evangelist, head of community relations, and product manager. "
},
{
"name": "Robin",
"surname": "Bramley",
"company": "Chief Scientific Officer, Ixxus",
"companyUrl": "",
"image": "RobinBramley.png",
"summary":"Robin Bramley is the Chief Scientific Officer at Ixxus, a global Alfresco Platinum Partner.  He took Alfresco 0.6 to bits in 2005 and has been using/extending/implementing/integrating/scaling it ever since. Whilst Technical Manager at the first UK Alfresco Gold partner, he built the original IMAP interface to Alfresco. Robin has architected many distributed systems over the past 18 years ranging from a Swaps Trading Platform to Insurance Contract Management and a global Alfresco-based DAM system.  Robin has presented at various international conferences and London meetups; his blog is syndicated by DZone and he has written a series of articles for GroovyMag, including one on CMIS integration with Alfresco that NASA wanted the source code for. "
},
{
"name": "Samuel",
"surname": "Langlois",
"company": "Build Engineer at Alfresco",
"companyUrl": "",
"image": "SamuelLanglois.png",
"summary":"I joined Alfresco in April 2012, and I've been taking care of its build framework, continuous integration and releases. Lately, I've helped with splitting Alfresco Platform and Alfresco Share. I'm usually referred to as 'the Maven guy'… "
},
{
"name": "Sujay",
"surname": "Pillai",
"company": "Alfresco Consultant at Jabil",
"companyUrl": "",
"image": "SujayPillai.png",
"summary":"Lucky enough to start with my career as an Alfresco Developer with my first project assignment at my first job back in 2007 and the journey continues. Aikau Audit Report was developed by me in 2015 and shared with community. "
},
{
"name": "Thomas",
"surname": "DeMeo",
"company": "Vice President of Product Management",
"companyUrl": "",
"image": "ThomasDeMeo.png",
"summary":"I joined Alfresco in March 2014. Working as Vice President of Product Management I can enlighten the audience on the roadmap of the Alfresco product "
},
{
"name": "Younes",
"surname": "Regaieg",
"company": "ECM R&D Engineer",
"companyUrl": "",
"image": "YounesRegaieg.png",
"summary":"Check any of my previous submissions "
},
{
"name": "Jeff",
"surname": "Potts",
"company": "Developer at Metaversant",
"companyUrl": "",
"image": "JeffPotts.png",
"summary":"Jeff has made many contributions to the Alfresco community since he started working with Alfresco in 2005. Examples range from code, to tutorials and informative blog posts, to code camps, meetups, and conference sessions. In 2008, Jeff wrote the Alfresco Developer Guide, the first developer-focused book on Alfresco.  In November of 2009, Jeff started working with CMIS. He wrote a 'Getting Started with CMIS' tutorial based on the draft specification. Then, in December, Jeff released the first version of cmislib, a Python client API for CMIS. In February of 2010, the Apache Chemistry project invited cmislib to become the first non-Java library to become part of the project. The following month, Jeff co-authored a two part introduction to cmislib for IBM developerWorks.  Since then, Jeff has continued to maintain cmislib and regularly speaks on the library and the CMIS specification at conferences such as JBoss World, OSCON, JavaONE, and Devoxx. "
},
{
"name": "Tahir",
"surname": "Malik",
"company": "Contezza",
"companyUrl": "",
"image": "TahirMalik.png",
"summary":"It's a use case where we've used a mail poller to poll mail in Alfresco, send them to a workflow and create cases in Alfresco. This whole process is used to provide efficiency for organ and tissue donation process within Europe. The technical pieces will be outlined: - Zoom-in on the Mail Poller. It's a simple Imap, but it re-uses Alfresco's inbound code to separate mails and attachments (Alfresco's code is buggy so we've fixed a lot of stuff) - The Activiti process from incoming mail and attachments to custom controls we've used on the workflow form - Future: Alfresco 5 (in development) and use of Ephesoft classification "
},
{
"name": "Enzo",
"surname": "Rivello",
"company": "Alfresco",
"companyUrl": "",
"image": "EnzoRivello.png",
"summary":"Alfresco Engineer "
}
]